sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/instance/xdmac.h
/**
 * \file
 *
 * \brief Instance description for XDMAC
 *
 * Copyright (c) 2018 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-01-08T14:00:00Z */
#ifndef _SAMS70_XDMAC_INSTANCE_H_
#define _SAMS70_XDMAC_INSTANCE_H_

/* ========== Register definition for XDMAC peripheral ========== */
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define REG_XDMAC_CIE0          (0x40078050) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 0 */
#define REG_XDMAC_CID0          (0x40078054) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 0 */
#define REG_XDMAC_CIM0          (0x40078058) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 0 */
#define REG_XDMAC_CIS0          (0x4007805C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 0 */
#define REG_XDMAC_CSA0          (0x40078060) /**< (XDMAC) Channel Source Address Register (chid = 0) 0 */
#define REG_XDMAC_CDA0          (0x40078064) /**< (XDMAC) Channel Destination Address Register (chid = 0) 0 */
#define REG_XDMAC_CNDA0         (0x40078068) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 0 */
#define REG_XDMAC_CNDC0         (0x4007806C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 0 */
#define REG_XDMAC_CUBC0         (0x40078070) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 0 */
#define REG_XDMAC_CBC0          (0x40078074) /**< (XDMAC) Channel Block Control Register (chid = 0) 0 */
#define REG_XDMAC_CC0           (0x40078078) /**< (XDMAC) Channel Configuration Register (chid = 0) 0 */
#define REG_XDMAC_CDS_MSP0      (0x4007807C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 0 */
#define REG_XDMAC_CSUS0         (0x40078080) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 0 */
#define REG_XDMAC_CDUS0         (0x40078084) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 0 */
#define REG_XDMAC_CIE1          (0x40078090) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 1 */
#define REG_XDMAC_CID1          (0x40078094) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 1 */
#define REG_XDMAC_CIM1          (0x40078098) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 1 */
#define REG_XDMAC_CIS1          (0x4007809C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 1 */
#define REG_XDMAC_CSA1          (0x400780A0) /**< (XDMAC) Channel Source Address Register (chid = 0) 1 */
#define REG_XDMAC_CDA1          (0x400780A4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 1 */
#define REG_XDMAC_CNDA1         (0x400780A8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 1 */
#define REG_XDMAC_CNDC1         (0x400780AC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 1 */
#define REG_XDMAC_CUBC1         (0x400780B0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 1 */
#define REG_XDMAC_CBC1          (0x400780B4) /**< (XDMAC) Channel Block Control Register (chid = 0) 1 */
#define REG_XDMAC_CC1           (0x400780B8) /**< (XDMAC) Channel Configuration Register (chid = 0) 1 */
#define REG_XDMAC_CDS_MSP1      (0x400780BC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 1 */
#define REG_XDMAC_CSUS1         (0x400780C0) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 1 */
#define REG_XDMAC_CDUS1         (0x400780C4) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 1 */
#define REG_XDMAC_CIE2          (0x400780D0) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 2 */
#define REG_XDMAC_CID2          (0x400780D4) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 2 */
#define REG_XDMAC_CIM2          (0x400780D8) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 2 */
#define REG_XDMAC_CIS2          (0x400780DC) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 2 */
#define REG_XDMAC_CSA2          (0x400780E0) /**< (XDMAC) Channel Source Address Register (chid = 0) 2 */
#define REG_XDMAC_CDA2          (0x400780E4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 2 */
#define REG_XDMAC_CNDA2         (0x400780E8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 2 */
#define REG_XDMAC_CNDC2         (0x400780EC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 2 */
#define REG_XDMAC_CUBC2         (0x400780F0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 2 */
#define REG_XDMAC_CBC2          (0x400780F4) /**< (XDMAC) Channel Block Control Register (chid = 0) 2 */
#define REG_XDMAC_CC2           (0x400780F8) /**< (XDMAC) Channel Configuration Register (chid = 0) 2 */
#define REG_XDMAC_CDS_MSP2      (0x400780FC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 2 */
#define REG_XDMAC_CSUS2         (0x40078100) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 2 */
#define REG_XDMAC_CDUS2         (0x40078104) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 2 */
#define REG_XDMAC_CIE3          (0x40078110) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 3 */
#define REG_XDMAC_CID3          (0x40078114) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 3 */
#define REG_XDMAC_CIM3          (0x40078118) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 3 */
#define REG_XDMAC_CIS3          (0x4007811C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 3 */
#define REG_XDMAC_CSA3          (0x40078120) /**< (XDMAC) Channel Source Address Register (chid = 0) 3 */
#define REG_XDMAC_CDA3          (0x40078124) /**< (XDMAC) Channel Destination Address Register (chid = 0) 3 */
#define REG_XDMAC_CNDA3         (0x40078128) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 3 */
#define REG_XDMAC_CNDC3         (0x4007812C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 3 */
#define REG_XDMAC_CUBC3         (0x40078130) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 3 */
#define REG_XDMAC_CBC3          (0x40078134) /**< (XDMAC) Channel Block Control Register (chid = 0) 3 */
#define REG_XDMAC_CC3           (0x40078138) /**< (XDMAC) Channel Configuration Register (chid = 0) 3 */
#define REG_XDMAC_CDS_MSP3      (0x4007813C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 3 */
#define REG_XDMAC_CSUS3         (0x40078140) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 3 */
#define REG_XDMAC_CDUS3         (0x40078144) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 3 */
#define REG_XDMAC_CIE4          (0x40078150) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 4 */
#define REG_XDMAC_CID4          (0x40078154) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 4 */
#define REG_XDMAC_CIM4          (0x40078158) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 4 */
#define REG_XDMAC_CIS4          (0x4007815C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 4 */
#define REG_XDMAC_CSA4          (0x40078160) /**< (XDMAC) Channel Source Address Register (chid = 0) 4 */
#define REG_XDMAC_CDA4          (0x40078164) /**< (XDMAC) Channel Destination Address Register (chid = 0) 4 */
#define REG_XDMAC_CNDA4         (0x40078168) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 4 */
#define REG_XDMAC_CNDC4         (0x4007816C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 4 */
#define REG_XDMAC_CUBC4         (0x40078170) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 4 */
#define REG_XDMAC_CBC4          (0x40078174) /**< (XDMAC) Channel Block Control Register (chid = 0) 4 */
#define REG_XDMAC_CC4           (0x40078178) /**< (XDMAC) Channel Configuration Register (chid = 0) 4 */
#define REG_XDMAC_CDS_MSP4      (0x4007817C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 4 */
#define REG_XDMAC_CSUS4         (0x40078180) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 4 */
#define REG_XDMAC_CDUS4         (0x40078184) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 4 */
#define REG_XDMAC_CIE5          (0x40078190) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 5 */
#define REG_XDMAC_CID5          (0x40078194) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 5 */
#define REG_XDMAC_CIM5          (0x40078198) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 5 */
#define REG_XDMAC_CIS5          (0x4007819C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 5 */
#define REG_XDMAC_CSA5          (0x400781A0) /**< (XDMAC) Channel Source Address Register (chid = 0) 5 */
#define REG_XDMAC_CDA5          (0x400781A4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 5 */
#define REG_XDMAC_CNDA5         (0x400781A8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 5 */
#define REG_XDMAC_CNDC5         (0x400781AC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 5 */
#define REG_XDMAC_CUBC5         (0x400781B0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 5 */
#define REG_XDMAC_CBC5          (0x400781B4) /**< (XDMAC) Channel Block Control Register (chid = 0) 5 */
#define REG_XDMAC_CC5           (0x400781B8) /**< (XDMAC) Channel Configuration Register (chid = 0) 5 */
#define REG_XDMAC_CDS_MSP5      (0x400781BC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 5 */
#define REG_XDMAC_CSUS5         (0x400781C0) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 5 */
#define REG_XDMAC_CDUS5         (0x400781C4) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 5 */
#define REG_XDMAC_CIE6          (0x400781D0) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 6 */
#define REG_XDMAC_CID6          (0x400781D4) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 6 */
#define REG_XDMAC_CIM6          (0x400781D8) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 6 */
#define REG_XDMAC_CIS6          (0x400781DC) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 6 */
#define REG_XDMAC_CSA6          (0x400781E0) /**< (XDMAC) Channel Source Address Register (chid = 0) 6 */
#define REG_XDMAC_CDA6          (0x400781E4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 6 */
#define REG_XDMAC_CNDA6         (0x400781E8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 6 */
#define REG_XDMAC_CNDC6         (0x400781EC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 6 */
#define REG_XDMAC_CUBC6         (0x400781F0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 6 */
#define REG_XDMAC_CBC6          (0x400781F4) /**< (XDMAC) Channel Block Control Register (chid = 0) 6 */
#define REG_XDMAC_CC6           (0x400781F8) /**< (XDMAC) Channel Configuration Register (chid = 0) 6 */
#define REG_XDMAC_CDS_MSP6      (0x400781FC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 6 */
#define REG_XDMAC_CSUS6         (0x40078200) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 6 */
#define REG_XDMAC_CDUS6         (0x40078204) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 6 */
#define REG_XDMAC_CIE7          (0x40078210) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 7 */
#define REG_XDMAC_CID7          (0x40078214) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 7 */
#define REG_XDMAC_CIM7          (0x40078218) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 7 */
#define REG_XDMAC_CIS7          (0x4007821C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 7 */
#define REG_XDMAC_CSA7          (0x40078220) /**< (XDMAC) Channel Source Address Register (chid = 0) 7 */
#define REG_XDMAC_CDA7          (0x40078224) /**< (XDMAC) Channel Destination Address Register (chid = 0) 7 */
#define REG_XDMAC_CNDA7         (0x40078228) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 7 */
#define REG_XDMAC_CNDC7         (0x4007822C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 7 */
#define REG_XDMAC_CUBC7         (0x40078230) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 7 */
#define REG_XDMAC_CBC7          (0x40078234) /**< (XDMAC) Channel Block Control Register (chid = 0) 7 */
#define REG_XDMAC_CC7           (0x40078238) /**< (XDMAC) Channel Configuration Register (chid = 0) 7 */
#define REG_XDMAC_CDS_MSP7      (0x4007823C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 7 */
#define REG_XDMAC_CSUS7         (0x40078240) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 7 */
#define REG_XDMAC_CDUS7         (0x40078244) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 7 */
#define REG_XDMAC_CIE8          (0x40078250) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 8 */
#define REG_XDMAC_CID8          (0x40078254) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 8 */
#define REG_XDMAC_CIM8          (0x40078258) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 8 */
#define REG_XDMAC_CIS8          (0x4007825C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 8 */
#define REG_XDMAC_CSA8          (0x40078260) /**< (XDMAC) Channel Source Address Register (chid = 0) 8 */
#define REG_XDMAC_CDA8          (0x40078264) /**< (XDMAC) Channel Destination Address Register (chid = 0) 8 */
#define REG_XDMAC_CNDA8         (0x40078268) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 8 */
#define REG_XDMAC_CNDC8         (0x4007826C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 8 */
#define REG_XDMAC_CUBC8         (0x40078270) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 8 */
#define REG_XDMAC_CBC8          (0x40078274) /**< (XDMAC) Channel Block Control Register (chid = 0) 8 */
#define REG_XDMAC_CC8           (0x40078278) /**< (XDMAC) Channel Configuration Register (chid = 0) 8 */
#define REG_XDMAC_CDS_MSP8      (0x4007827C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 8 */
#define REG_XDMAC_CSUS8         (0x40078280) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 8 */
#define REG_XDMAC_CDUS8         (0x40078284) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 8 */
#define REG_XDMAC_CIE9          (0x40078290) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 9 */
#define REG_XDMAC_CID9          (0x40078294) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 9 */
#define REG_XDMAC_CIM9          (0x40078298) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 9 */
#define REG_XDMAC_CIS9          (0x4007829C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 9 */
#define REG_XDMAC_CSA9          (0x400782A0) /**< (XDMAC) Channel Source Address Register (chid = 0) 9 */
#define REG_XDMAC_CDA9          (0x400782A4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 9 */
#define REG_XDMAC_CNDA9         (0x400782A8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 9 */
#define REG_XDMAC_CNDC9         (0x400782AC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 9 */
#define REG_XDMAC_CUBC9         (0x400782B0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 9 */
#define REG_XDMAC_CBC9          (0x400782B4) /**< (XDMAC) Channel Block Control Register (chid = 0) 9 */
#define REG_XDMAC_CC9           (0x400782B8) /**< (XDMAC) Channel Configuration Register (chid = 0) 9 */
#define REG_XDMAC_CDS_MSP9      (0x400782BC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 9 */
#define REG_XDMAC_CSUS9         (0x400782C0) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 9 */
#define REG_XDMAC_CDUS9         (0x400782C4) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 9 */
#define REG_XDMAC_CIE10         (0x400782D0) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 10 */
#define REG_XDMAC_CID10         (0x400782D4) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 10 */
#define REG_XDMAC_CIM10         (0x400782D8) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 10 */
#define REG_XDMAC_CIS10         (0x400782DC) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 10 */
#define REG_XDMAC_CSA10         (0x400782E0) /**< (XDMAC) Channel Source Address Register (chid = 0) 10 */
#define REG_XDMAC_CDA10         (0x400782E4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 10 */
#define REG_XDMAC_CNDA10        (0x400782E8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 10 */
#define REG_XDMAC_CNDC10        (0x400782EC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 10 */
#define REG_XDMAC_CUBC10        (0x400782F0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 10 */
#define REG_XDMAC_CBC10         (0x400782F4) /**< (XDMAC) Channel Block Control Register (chid = 0) 10 */
#define REG_XDMAC_CC10          (0x400782F8) /**< (XDMAC) Channel Configuration Register (chid = 0) 10 */
#define REG_XDMAC_CDS_MSP10     (0x400782FC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 10 */
#define REG_XDMAC_CSUS10        (0x40078300) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 10 */
#define REG_XDMAC_CDUS10        (0x40078304) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 10 */
#define REG_XDMAC_CIE11         (0x40078310) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 11 */
#define REG_XDMAC_CID11         (0x40078314) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 11 */
#define REG_XDMAC_CIM11         (0x40078318) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 11 */
#define REG_XDMAC_CIS11         (0x4007831C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 11 */
#define REG_XDMAC_CSA11         (0x40078320) /**< (XDMAC) Channel Source Address Register (chid = 0) 11 */
#define REG_XDMAC_CDA11         (0x40078324) /**< (XDMAC) Channel Destination Address Register (chid = 0) 11 */
#define REG_XDMAC_CNDA11        (0x40078328) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 11 */
#define REG_XDMAC_CNDC11        (0x4007832C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 11 */
#define REG_XDMAC_CUBC11        (0x40078330) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 11 */
#define REG_XDMAC_CBC11         (0x40078334) /**< (XDMAC) Channel Block Control Register (chid = 0) 11 */
#define REG_XDMAC_CC11          (0x40078338) /**< (XDMAC) Channel Configuration Register (chid = 0) 11 */
#define REG_XDMAC_CDS_MSP11     (0x4007833C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 11 */
#define REG_XDMAC_CSUS11        (0x40078340) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 11 */
#define REG_XDMAC_CDUS11        (0x40078344) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 11 */
#define REG_XDMAC_CIE12         (0x40078350) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 12 */
#define REG_XDMAC_CID12         (0x40078354) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 12 */
#define REG_XDMAC_CIM12         (0x40078358) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 12 */
#define REG_XDMAC_CIS12         (0x4007835C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 12 */
#define REG_XDMAC_CSA12         (0x40078360) /**< (XDMAC) Channel Source Address Register (chid = 0) 12 */
#define REG_XDMAC_CDA12         (0x40078364) /**< (XDMAC) Channel Destination Address Register (chid = 0) 12 */
#define REG_XDMAC_CNDA12        (0x40078368) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 12 */
#define REG_XDMAC_CNDC12        (0x4007836C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 12 */
#define REG_XDMAC_CUBC12        (0x40078370) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 12 */
#define REG_XDMAC_CBC12         (0x40078374) /**< (XDMAC) Channel Block Control Register (chid = 0) 12 */
#define REG_XDMAC_CC12          (0x40078378) /**< (XDMAC) Channel Configuration Register (chid = 0) 12 */
#define REG_XDMAC_CDS_MSP12     (0x4007837C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 12 */
#define REG_XDMAC_CSUS12        (0x40078380) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 12 */
#define REG_XDMAC_CDUS12        (0x40078384) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 12 */
#define REG_XDMAC_CIE13         (0x40078390) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 13 */
#define REG_XDMAC_CID13         (0x40078394) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 13 */
#define REG_XDMAC_CIM13         (0x40078398) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 13 */
#define REG_XDMAC_CIS13         (0x4007839C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 13 */
#define REG_XDMAC_CSA13         (0x400783A0) /**< (XDMAC) Channel Source Address Register (chid = 0) 13 */
#define REG_XDMAC_CDA13         (0x400783A4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 13 */
#define REG_XDMAC_CNDA13        (0x400783A8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 13 */
#define REG_XDMAC_CNDC13        (0x400783AC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 13 */
#define REG_XDMAC_CUBC13        (0x400783B0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 13 */
#define REG_XDMAC_CBC13         (0x400783B4) /**< (XDMAC) Channel Block Control Register (chid = 0) 13 */
#define REG_XDMAC_CC13          (0x400783B8) /**< (XDMAC) Channel Configuration Register (chid = 0) 13 */
#define REG_XDMAC_CDS_MSP13     (0x400783BC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 13 */
#define REG_XDMAC_CSUS13        (0x400783C0) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 13 */
#define REG_XDMAC_CDUS13        (0x400783C4) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 13 */
#define REG_XDMAC_CIE14         (0x400783D0) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 14 */
#define REG_XDMAC_CID14         (0x400783D4) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 14 */
#define REG_XDMAC_CIM14         (0x400783D8) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 14 */
#define REG_XDMAC_CIS14         (0x400783DC) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 14 */
#define REG_XDMAC_CSA14         (0x400783E0) /**< (XDMAC) Channel Source Address Register (chid = 0) 14 */
#define REG_XDMAC_CDA14         (0x400783E4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 14 */
#define REG_XDMAC_CNDA14        (0x400783E8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 14 */
#define REG_XDMAC_CNDC14        (0x400783EC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 14 */
#define REG_XDMAC_CUBC14        (0x400783F0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 14 */
#define REG_XDMAC_CBC14         (0x400783F4) /**< (XDMAC) Channel Block Control Register (chid = 0) 14 */
#define REG_XDMAC_CC14          (0x400783F8) /**< (XDMAC) Channel Configuration Register (chid = 0) 14 */
#define REG_XDMAC_CDS_MSP14     (0x400783FC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 14 */
#define REG_XDMAC_CSUS14        (0x40078400) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 14 */
